---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.SetMaxRangeToUnlimited
source: html/a67160b4-ad0d-ecfe-497a-d7a621a4e065.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.SetMaxRangeToUnlimited Method

Sets the max range on the value to unlimited

## Syntax (C#)
```csharp
public void SetMaxRangeToUnlimited()
```